app/Services/ScheckRunService.php

    public static function currentRun(): ?ScheckRun
    {
        $runId = session('scheck_run_id');

        return $runId ? ScheckRun::find($runId) : null;
---
select * from `scheck_runs` where `scheck_runs`.`id` = 4 limit 1

    public static function settings(ScheckRun $run): ScheckSetting
    {
        return ScheckSetting::firstOrNew(['run_id' => $run->id]);
---
select * from `scheck_settings` where (`run_id` = 4) limit 1

    public static function site(ScheckRun $run): ScheckSite
    {
        return ScheckSite::firstOrNew(['run_id' => $run->id]);
---
select * from `scheck_sites` where (`run_id` = 4) limit 1

    public static function generalRanges(ScheckRun $run): Collection
    {
        return ScheckGeneralRange::where('run_id', $run->id)->get()->keyBy('range_code');
---
select * from `scheck_general_ranges` where `run_id` = 4

    public static function updateGeneralRange(ScheckRun $run, int $rangeCode, array $attributes): ScheckGeneralRange
    {
        return tap(ScheckGeneralRange::updateOrCreate(
            ['run_id' => $run->id, 'range_code' => $rangeCode],
            Arr::only($attributes, [
                'S', 'L', 'H', 'A', 'Pbtm', 'Vz', 'QzN', 'Wup', 'Wdn',
            ])
        ))->refresh();
---
select * from `scheck_general_ranges` where (`run_id` = 5 and `range_code` = 10) limit 1

    public static function maybePruneGeneralRange(ScheckRun $run, int $rangeCode, array $attributes): void
    {
        if (collect($attributes)->filter(fn ($v) => !is_null($v))->isEmpty()) {
            ScheckGeneralRange::where('run_id', $run->id)
                ->where('range_code', $rangeCode)
                ->delete();
---
delete from `scheck_general_ranges` where `run_id` = 5 and `range_code` = 35

    public static function topRanges(ScheckRun $run): Collection
    {
        return ScheckTopRange::where('run_id', $run->id)->get()->keyBy('range_code');
---
select * from `scheck_top_ranges` where `run_id` = 4

    public static function updateTopRange(ScheckRun $run, int $rangeCode, array $attributes): ScheckTopRange
    {
        return tap(ScheckTopRange::updateOrCreate(
            ['run_id' => $run->id, 'range_code' => $rangeCode],
            Arr::only($attributes, [
                'Ltop', 'Htopup', 'Htopdn', 'Ptop', 'Wup', 'Wdn',
            ])
        ))->refresh();
---
insert into `scheck_top_ranges` (`run_id`, `range_code`, `Wup`, `Wdn`, `updated_at`, `created_at`) values (5, 20, null, null, '2025-09-22 04:41:20', '2025-09-22 04:41:20')
select * from `scheck_top_ranges` where (`run_id` = 4 and `range_code` = 20) limit 1

    public static function result(ScheckRun $run): ScheckResult
    {
        return ScheckResult::firstOrNew(['run_id' => $run->id]);
---
select * from `scheck_results` where (`run_id` = 4) limit 1