routes/web.php

    ]);

    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;
---
select * from `scheck_params` where `scheck_params`.`id` = 9 limit 1