routes/web.php

insert into `scheck_params` (`Vo`, `updated_at`, `created_at`) values ('16', '2025-09-14 04:13:54', '2025-09-14 04:13:54')
---
    // 既存テーブルへ保存（従来動作の維持）
    $param = new \App\Models\ScheckParam();
    $param->Vo = $validated['Vo'];
    $param->save();

update `scheck_params` set `S10` = '1.19', `S20` = '1.25', `S35` = '1.36', `S40` = '1.46', `S50` = '1.46', `S55` = '1.55', `S70` = '1.55', `S100` = '1.64', `scheck_params`.`updated_at` = '2025-09-13 08:01:50' where `id` = 12
select * from `scheck_params` where `scheck_params`.`id` = 12 limit 1
select * from `scheck_params` where `scheck_params`.`id` = 1 limit 1
---
})->name('scheck.environment.save');

// S係数保存
Route::post('/scheck/s-coefficient', function (\Illuminate\Http\Request $request) {
    $validated = $request->validate([
        'S10' => ['required', 'numeric'],
        'S20' => ['required', 'numeric'],
        'S35' => ['required', 'numeric'],
        'S40' => ['required', 'numeric'],
        'S50' => ['required', 'numeric'],
        'S55' => ['required', 'numeric'],
        'S70' => ['required', 'numeric'],
        'S100' => ['required', 'numeric'],
    ]);

    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;
    if (!$param) {
        $param = new \App\Models\ScheckParam();
    }

    $param->fill($validated);
    $param->save();
    session(['scheck_param_id' => $param->id]);

select * from `scheck_params` where `scheck_params`.`id` = 4 limit 1
select * from `scheck_params` where `scheck_params`.`id` = 7 limit 1
---
})->name('scheck.s-coefficient');

// Ke係数保存
Route::post('/scheck/ke-coefficient', function (\Illuminate\Http\Request $request) {
    $validated = $request->validate([
        'Ke' => ['required', 'numeric', 'min:1.0', 'max:1.2'],
    ]);

    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;
    if (!$param) {
        $param = new \App\Models\ScheckParam();
    }

    $param->fill($validated);
    $param->save();
    session(['scheck_param_id' => $param->id]);

    // 正規化スキーマにも保存（新実装）
    $runId = session('scheck_run_id');
    $run = $runId ? \App\Models\ScheckRun::find($runId) : null;
    if (!$run) {
        $run = \App\Models\ScheckRun::create([
            'status' => 'draft',

select * from `scheck_params` where `scheck_params`.`id` = 1 limit 1
---
})->name('scheck.ke-coefficient');

// EB係数保存
Route::post('/scheck/eb-coefficient', function (\Illuminate\Http\Request $request) {
    $validated = $request->validate([
        'EB' => ['required', 'numeric', 'min:1.0', 'max:1.3'],
    ]);

    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;
    if (!$param) {
        $param = new \App\Models\ScheckParam();
    }

    $param->fill($validated);
    $param->save();
    session(['scheck_param_id' => $param->id]);

    // 正規化スキーマにも保存（新実装）
    $runId = session('scheck_run_id');
    $run = $runId ? \App\Models\ScheckRun::find($runId) : null;
    if (!$run) {
        $run = \App\Models\ScheckRun::create([
            'status' => 'draft',

select * from `scheck_params` where `scheck_params`.`id` = 1 limit 1
select * from `scheck_params` where `scheck_params`.`id` = 20 limit 1
select * from `scheck_runs` where `scheck_runs`.`id` = 4 limit 1
---
})->name('scheck.eb-coefficient');

// Eg係数保存
Route::post('/scheck/eg-coefficient', function (\Illuminate\Http\Request $request) {
    $validated = $request->validate([
        'Eg' => ['required', 'numeric', 'min:1.0', 'max:1.3'],
    ]);

    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;
    if (!$param) {
        $param = new \App\Models\ScheckParam();
    }

    $param->fill($validated);
    $param->save();
    session(['scheck_param_id' => $param->id]);

    // 正規化スキーマにも保存（新実装）
    $runId = session('scheck_run_id');
    $run = $runId ? \App\Models\ScheckRun::find($runId) : null;
    if (!$run) {
        $run = \App\Models\ScheckRun::create([
            'status' => 'draft',

select * from `scheck_settings` where (`run_id` = 4) limit 1
---
        ]);
    }

    \App\Models\ScheckSetting::updateOrCreate(
        ['run_id' => $run->id],
        ['Eg' => (float)$validated['Eg']]
    );

select * from `scheck_params` where `scheck_params`.`id` = 4 limit 1
select * from `scheck_params` where `scheck_params`.`id` = 3 limit 1
---
})->name('scheck.eg-coefficient');

// Co係数保存
Route::post('/scheck/co-coefficient', function (\Illuminate\Http\Request $request) {
    $validated = $request->validate([
        'Co' => ['required', 'numeric', 'min:0.1', 'max:2.5'],
        'phi' => ['required', 'numeric', 'min:0.1', 'max:1.5'],
    ]);

    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;
    if (!$param) {
        $param = new \App\Models\ScheckParam();
    }

    $param->fill($validated);
    $param->save();
    session(['scheck_param_id' => $param->id]);

    // 正規化スキーマにも保存（新実装）
    $runId = session('scheck_run_id');
    $run = $runId ? \App\Models\ScheckRun::find($runId) : null;
    if (!$run) {
        $run = \App\Models\ScheckRun::create([

select * from `scheck_params` where `scheck_params`.`id` = 8 limit 1
select * from `scheck_params` where `scheck_params`.`id` = 19 limit 1
select * from `scheck_runs` where `scheck_runs`.`id` = 4 limit 1
---
})->name('scheck.co-coefficient');

// 許容応力保存
Route::post('/scheck/allowable-stress', function (\Illuminate\Http\Request $request) {
    $validated = $request->validate([
        'wall_tie_stress' => ['required', 'numeric', 'min:0.1', 'max:10.0'],
        'War' => ['required', 'numeric', 'min:0.0', 'max:10.0'],
    ]);

    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;
    if (!$param) {
        $param = new \App\Models\ScheckParam();
    }

    $param->fill($validated);
    $param->save();
    session(['scheck_param_id' => $param->id]);

    // 正規化スキーマにも保存（新実装）
    $runId = session('scheck_run_id');
    $run = $runId ? \App\Models\ScheckRun::find($runId) : null;
    if (!$run) {
        $run = \App\Models\ScheckRun::create([

select * from `scheck_settings` where (`run_id` = 4) limit 1
---
        ]);
    }

    \App\Models\ScheckSetting::updateOrCreate(
        ['run_id' => $run->id],
        [
            'wall_tie_stress' => (float)$validated['wall_tie_stress'],
            'War' => (float)$validated['War'],
        ]
    );

select * from `scheck_params` where `scheck_params`.`id` = 19 limit 1
---
    }

    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;

select * from `scheck_runs` where `scheck_runs`.`id` = 4 limit 1
---

    // 正規化スキーマにも保存（新実装: L/H/A の併走保存）
    $runId = session('scheck_run_id');
    $run = $runId ? \App\Models\ScheckRun::find($runId) : null;

delete from `scheck_general_ranges` where `run_id` = 4 and `range_code` = 20
select * from `scheck_general_ranges` where (`run_id` = 4 and `range_code` = 10) limit 1
---
        $pbtm = $normalized["Pbtm{$range}"];

        if (is_null($l) && is_null($h) && is_null($a) && is_null($pbtm)) {
            \App\Models\ScheckGeneralRange::where('run_id', $run->id)
                ->where('range_code', (int) $range)
                ->delete();
            continue;
        }

        \App\Models\ScheckGeneralRange::updateOrCreate(
            ['run_id' => $run->id, 'range_code' => (int)$range],
            [
                'L' => $l,
                'H' => $h,
                'A' => $a,
                'Pbtm' => $pbtm,
            ]
        );

select * from `scheck_params` where `scheck_params`.`id` = 1 limit 1
select * from `scheck_params` where `scheck_params`.`id` = 20 limit 1
select * from `scheck_general_ranges` where `run_id` = 4
---
    return redirect()->route('scheck.wind-pressure-result');
})->name('scheck.input-parameters.save');

Route::get('/scheck/input-parameters', function () {
    // セッションからパラメータIDを取得
    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;

    $runId = session('scheck_run_id');
    $ranges = $runId
        ? \App\Models\ScheckGeneralRange::where('run_id', $runId)->get()->keyBy('range_code')
        : collect();

    return view('scheck.input-parameters', [
        'param' => $param,
        'ranges' => $ranges,
    ]);
})->name('scheck.input-parameters');

select * from `scheck_params` where `scheck_params`.`id` = 18 limit 1
---
    ]);

    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;

select * from `scheck_runs` where `scheck_runs`.`id` = 3 limit 1
select * from `scheck_general_ranges` where (`run_id` = 3 and `range_code` = 10) limit 1
---

    // 正規化スキーマにも保存（新実装: A の併走保存）
    $runId = session('scheck_run_id');
    $run = $runId ? \App\Models\ScheckRun::find($runId) : null;
    if ($run) {
        \App\Models\ScheckGeneralRange::updateOrCreate(
            ['run_id' => $run->id, 'range_code' => (int)$heightRange],
            ['A' => $param->{$aColumn}]
        );

select * from `scheck_params` where `scheck_params`.`id` = 7 limit 1
---
// 計算実行
Route::post('/scheck/calculate', function (\Illuminate\Http\Request $request) {
    $id = session('scheck_param_id');
    $param = $id ? \App\Models\ScheckParam::find($id) : null;

select * from `scheck_runs` where `scheck_runs`.`id` = 2 limit 1
---

    // ScheckResult にも保存
    $runId = session('scheck_run_id');
    $run = $runId ? \App\Models\ScheckRun::find($runId) : null;

select * from `scheck_params` where (`Lg` is not null or `Bg` is not null or `Ba` is not null or `Ha` is not null) and `id` != 19 order by `id` desc limit 1
select * from `scheck_params` where `scheck_params`.`id` = 18 limit 1
---
    return redirect()->route('scheck.input-confirmation');
})->name('scheck.site.save');

Route::get('/scheck/site', function () {
    $paramId = session('scheck_param_id');
    $param = $paramId ? \App\Models\ScheckParam::find($paramId) : null;

    $runId = session('scheck_run_id');
    $site = $runId ? \App\Models\ScheckSite::where('run_id', $runId)->first() : null;

    $prefill = [
        'Lg' => optional($site)->Lg ?? optional($param)->Lg,
        'Bg' => optional($site)->Bg ?? optional($param)->Bg,
        'Ba' => optional($site)->Ba ?? optional($param)->Ba,
        'Ha' => optional($site)->Ha ?? optional($param)->Ha,
    ];

    return view('scheck.site', compact('prefill'));
})->name('scheck.site');

// 最終値取得API
Route::get('/scheck/site/get-last-values', function () {
    // 現在のセッションのレコードIDを取得
    $currentId = session('scheck_param_id');

    // 現在のレコード以外で最新のレコードを取得（Lg, Bg, Ba, Haのいずれかが入力されているもの）
    $lastParam = \App\Models\ScheckParam::where(function ($query) {
        $query->whereNotNull('Lg')
            ->orWhereNotNull('Bg')
            ->orWhereNotNull('Ba')
            ->orWhereNotNull('Ha');
    })
        ->when($currentId, function ($query, $currentId) {
            return $query->where('id', '!=', $currentId);
        })
        ->orderBy('id', 'desc')
        ->first();

    if (!$lastParam) {
        return response()->json([
            'Lg' => null,
            'Bg' => null,